## Numpy

Task 1

In [7]:
import numpy as np

In [4]:
a = np.array([[1, 6],
            [2, 8],
            [3, 11],
            [3, 10],
            [1, 7]])
a.shape

(5, 2)

In [6]:
mean_a = (a.mean(axis = 0))

In [16]:
print(f'The average of the columns: {mean_a}')

The average of the columns: [2.  8.4]

Task 2

In [11]:
a_centered = a - mean_a
a_centered

array([[-1. , -2.4],
       [ 0. , -0.4],
       [ 1. ,  2.6],
       [ 1. ,  1.6],
       [-1. , -1.4]])

Task 3

In [13]:
a1 = a_centered[:, 0].copy()
a2 = a_centered[:, 1].copy()
a_centered_sp = np.dot (a1, a2)

In [18]:
print(f'result = {a_centered_sp/(len(a)-1)}')

result = 2.0

Task 4

In [23]:
m = a.T
cov_a = np.cov(m)
print(f'covariance = {cov_a[0, 1]}')

covariance = 2.0

## Pandas

Task 1

In [24]:
import pandas as pd

In [26]:
authors = pd.DataFrame({'author_id': [1, 2, 3],
    'author_name': ['Turgenev', 'Chehov', 'Ostrovskiy'],
})
authors

   author_id author_name
0          1    Turgenev
1          2      Chehov
2          3  Ostrovskiy

In [27]:
books = pd.DataFrame ({'author_id': [1, 1, 1, 2, 2, 3, 3], 
                      'book_title': ['Ottsy i deti', 'Rudin', 'Dvoriynskoe gnezdo', 'Tolstiy i tonkiy', 'Dama s sobachkoiy', 
                                    'Groza', 'Talanty i poklonniki'],
                      'price': [450, 300, 350, 500, 450, 370, 290]})
books

   author_id            book_title  price
0          1          Ottsy i deti    450
1          1                 Rudin    300
2          1    Dvoriynskoe gnezdo    350
3          2      Tolstiy i tonkiy    500
4          2     Dama s sobachkoiy    450
5          3                 Groza    370
6          3  Talanty i poklonniki    290

Task 2

In [28]:
authors_price = pd.merge(authors, books, on='author_id', how='inner')
authors_price

   author_id author_name            book_title  price
0          1    Turgenev          Ottsy i deti    450
1          1    Turgenev                 Rudin    300
2          1    Turgenev    Dvoriynskoe gnezdo    350
3          2      Chehov      Tolstiy i tonkiy    500
4          2      Chehov     Dama s sobachkoiy    450
5          3  Ostrovskiy                 Groza    370
6          3  Ostrovskiy  Talanty i poklonniki    290

Task 3

In [39]:
top5 = authors_price.sort_values(by = ['price'], ascending = False).reset_index(drop = True)
top5.head(5)

   author_id author_name          book_title  price
0          2      Chehov    Tolstiy i tonkiy    500
1          1    Turgenev        Ottsy i deti    450
2          2      Chehov   Dama s sobachkoiy    450
3          3  Ostrovskiy               Groza    370
4          1    Turgenev  Dvoriynskoe gnezdo    350

Task 4

In [57]:
groupby_a = authors_price.groupby("author_name")

In [70]:
authors_stat = (groupby_a.agg({"price": ['min', 'max', 'mean']})).rename({'min':'min_price', 
                                                                          'max':'max_price', 
                                                                          'mean':'mean_price'}, axis=1)
authors_stat

                price
            min_price max_price  mean_price
author_name
Chehov            450       500  475.000000
Ostrovskiy        290       370  330.000000
Turgenev          300       450  366.666667

Task 5

In [82]:
cover_str = ['твердая', 'мягкая', 'мягкая', 'твердая', 'твердая', 'мягкая', 'мягкая']
authors_price['cover'] = cover_str
authors_price

   author_id author_name            book_title  price    cover
0          1    Turgenev          Ottsy i deti    450  твердая
1          1    Turgenev                 Rudin    300   мягкая
2          1    Turgenev    Dvoriynskoe gnezdo    350   мягкая
3          2      Chehov      Tolstiy i tonkiy    500  твердая
4          2      Chehov     Dama s sobachkoiy    450  твердая
5          3  Ostrovskiy                 Groza    370   мягкая
6          3  Ostrovskiy  Talanty i poklonniki    290   мягкая

In [83]:
?pd.pivot_table

In [85]:
import numpy as np

In [94]:
book_info = pd.pivot_table(authors_price,
               index=['author_name'],
              columns=['cover'],
              values=['price'],
              aggfunc=[np.sum],
              fill_value=0)
book_info

               sum
             price
cover       мягкая твердая
author_name
Chehov           0     950
Ostrovskiy     660       0
Turgenev       650     450

In [99]:
book_info.to_pickle("book_info.pkl")

In [101]:
book_info2 = pd.read_pickle("book_info.pkl")
book_info2

               sum
             price
cover       мягкая твердая
author_name
Chehov           0     950
Ostrovskiy     660       0
Turgenev       650     450